In [2]:
import pandas as pd
import numpy as np

In [6]:

technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas","Oracle","Java"],
    'Fee' :[20000,25000,26000,22000,24000,21000,22000],
    'Duration':['30days','40days','35days','40days',np.nan,None,'55days'],
    'Discount':[1000,2300,1500,1200,2500,2100,2000]
               }

In [7]:
display(technologies)

{'Courses': ['Spark',
  'PySpark',
  'Hadoop',
  'Python',
  'pandas',
  'Oracle',
  'Java'],
 'Fee': [20000, 25000, 26000, 22000, 24000, 21000, 22000],
 'Duration': ['30days', '40days', '35days', '40days', nan, None, '55days'],
 'Discount': [1000, 2300, 1500, 1200, 2500, 2100, 2000]}

In [8]:
index_labels = ['r1', 'r2', 'r3', 'r4', 'r5', 'r6', 'r7']

In [10]:
df = pd.DataFrame(technologies, index=index_labels)

In [11]:
df

    Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   pandas  24000      NaN      2500
r6   Oracle  21000     None      2100
r7     Java  22000   55days      2000

In [13]:
df.iloc[2]   # select a row by Integer index

Courses     Hadoop
Fee          26000
Duration    35days
Discount      1500
Name: r3, dtype: object

In [14]:
df.iloc[ [2,3,6] ] # select multiple rows by index list

   Courses    Fee Duration  Discount
r3  Hadoop  26000   35days      1500
r4  Python  22000   40days      1200
r7    Java  22000   55days      2000

In [16]:
df.iloc[1:5]   # select rows by integer index range

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   pandas  24000      NaN      2500

In [17]:
df.iloc[:1] # select firt row by index

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000

In [18]:
df.iloc[:3] # select first 3 rows

    Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500

In [19]:
df.iloc[-1:] #select last row by index

   Courses    Fee Duration  Discount
r7    Java  22000   55days      2000

In [20]:
df.iloc[-3:] #select last 3 rows

   Courses    Fee Duration  Discount
r5  pandas  24000      NaN      2500
r6  Oracle  21000     None      2100
r7    Java  22000   55days      2000

In [21]:
#

In [22]:
# Use loc[] to select rows by index Labels

In [23]:
df

    Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   pandas  24000      NaN      2500
r6   Oracle  21000     None      2100
r7     Java  22000   55days      2000

In [24]:
df.loc['r2']  # select row by index label

Courses     PySpark
Fee           25000
Duration     40days
Discount       2300
Name: r2, dtype: object

In [25]:
df.loc [ ['r2', 'r3', 'r4']] #select multiple rows by label list

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200

In [31]:
df.loc['r1':'r5'] #select rows by label index range

    Courses    Fee Duration  Discount
r1    Spark  20000   30days      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1500
r4   Python  22000   40days      1200
r5   pandas  24000      NaN      2500

In [33]:
df.loc['r1':'r5':2] #select alternate rows with in Index Labels

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      1000
r3  Hadoop  26000   35days      1500
r5  pandas  24000      NaN      2500